In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
# 创建Series
obj = pd.Series([4, 7, -5, 3])
print('obj.value=', obj.values)
print('obj.index=', obj.index)

obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

# 通过dict创建Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon':16000, 'Utah': 5000}
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj3 = pd.Series(sdata)
obj3

obj.value= [ 4  7 -5  3]
obj.index= RangeIndex(start=0, stop=4, step=1)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [14]:
list(sdata.keys()).sort()

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
print('frame=\n', frame, '\n')

frame['state']

frame=
    pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

## pandas中的重要功能

In [69]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

f = lambda x: x.max() - x.min()

data.apply(f, axis=1)

format = lambda x: '%.2f' %  x

data.applymap(format)

            one    two  three   four
Ohio       0.00   1.00   2.00   3.00
Colorado   4.00   5.00   6.00   7.00
Utah       8.00   9.00  10.00  11.00
New York  12.00  13.00  14.00  15.00

In [63]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 总结和描述性统计